app/Http/Controllers/Restaurant/RestaurantCalendarController.php

select * from `reservations` where `user_id` = 1 and `reservations`.`deleted_at` is null limit 1
select * from `moderators` where `user_id` = 1 and `moderators`.`deleted_at` is null limit 1
select * from `reservations` where `reservations`.`restaurant_id` in (1) and `reservations`.`deleted_at` is null
select * from `restaurants` where `restaurants`.`id` = 1 and `restaurants`.`deleted_at` is null limit 1
---
    public function index(Request $request)
    {
        $user = auth()->user();
        // check for getter choosenDate if is set then give only reservations for that day
        // if(request()->has('choosenDate')) {
        //     $choosenDate = request()->choosenDate;
        //     $restaurant = Moderator::where('user_id', $user->id)->first()->restaurant->with(['reservations' => function($query) use ($choosenDate) {
        //         $query->whereDate('date', $choosenDate);
        //     }])->first();
        //     return view('restaurant.calendar', compact('restaurant'));
        // }
        $reservation = Reservation::where('user_id', $user->id)->first();
        $moderator = Moderator::where('user_id', $user->id)->first();
        $restaurant = Restaurant::with('reservations')->find($moderator->restaurant_id);