app/Http/Controllers/Restaurant/RestaurantReservationController.php

    public function index(Request $request)
    {
        $user = auth()->user();
        $moderator = Moderator::where('user_id', $user->id)->first();
        $restaurant = Restaurant::find($moderator->restaurant_id);
        $pendingPerPage = $request->input('pendingPerPage', 10);
        $reservationsPerPage = $request->input('reservationsPerPage', 10);

        // Get the search query from the request
        $searchQuery = $request->input('search');

        // Get the current page numbers for pending and all reservations
        $currentPagePending = $request->input('page_pending', 1);
        $currentPageAll = $request->input('page_all', 1);

        if ($restaurant->reservations->count() > 0) {
---
select * from `moderators` where `user_id` = 1 and `moderators`.`deleted_at` is null limit 1
select * from `restaurants` where `restaurants`.`id` = 1 and `restaurants`.`deleted_at` is null limit 1
select * from `reservations` where `reservations`.`restaurant_id` = 1 and `reservations`.`restaurant_id` is not null and `reservations`.`deleted_at` is null