app/Http/Controllers/RestaurantController.php

select * from `categories` where `categories`.`menu_id` in (1)
select * from `menus` where `active` = 1 and `menus`.`restaurant_id` in (1) and `menus`.`deleted_at` is null
select * from `restaurants` where `restaurants`.`id` = '1' and `restaurants`.`deleted_at` is null limit 1
select * from `reviews` where `reviews`.`restaurant_id` in (1) and `reviews`.`deleted_at` is null
---
    public function show($id)
    {
        $restaurant = Restaurant::with('reviews', 'activeMenu.categories.products')->findOrFail($id);

select * from `restaurants` where `lat` between 41.984305712295 and 42.020278576532 and `lng` between 21.389773271743 and 21.438181278985 and `restaurants`.`deleted_at` is null
---
    public function getNearestRestaurants(Request $request)
    {
        $latitude = $request->input('latitude');
        $longitude = $request->input('longitude');

        // Calculate the bounding box coordinates for the 2km radius
        $earthRadius = 6371; // Earth's radius in kilometers
        $radius = 2; // Radius in kilometers

        $minLatitude = $latitude - ($radius / $earthRadius) * (180 / pi());
        $maxLatitude = $latitude + ($radius / $earthRadius) * (180 / pi());

        $minLongitude = $longitude - ($radius / $earthRadius) * (180 / pi()) / cos($latitude * (pi() / 180));
        $maxLongitude = $longitude + ($radius / $earthRadius) * (180 / pi()) / cos($latitude * (pi() / 180));

        // Find the nearest restaurants within the bounding box coordinates
        $nearestRestaurants = Restaurant::whereBetween('lat', [$minLatitude, $maxLatitude])
            ->whereBetween('lng', [$minLongitude, $maxLongitude])
            ->get();

select * from `tags` where `tags`.`deleted_at` is null
select * from `restaurants` where exists (select * from `tags` inner join `restaurant_tags` on `tags`.`id` = `restaurant_tags`.`tag_id` where `restaurants`.`id` = `restaurant_tags`.`restaurant_id` and `name` = 'Parking' and `tags`.`deleted_at` is null) and `restaurants`.`deleted_at` is null
---
    public function searchByTag($tag)
    {
        $tags = Tag::all(); // Retrieve all tags
        $allRestaurantsNumber = Restaurant::all()->count();
        // Query restaurants that have the selected tag
        $restaurants = Restaurant::with('tags')->whereHas('tags', function ($query) use ($tag) {
            $query->where('name', $tag);
        })->get();

select * from `restaurants` where `title` like '%bu%' and `restaurants`.`deleted_at` is null limit 1
---
    public function autocomplete(Request $request)
    {
        $term = $request->input('term');

        // Retrieve the restaurant based on the term
        $restaurant = Restaurant::where('title', 'like', '%' . $term . '%')->first();