app/Http/Controllers/TableController.php

    public function show($floorId)
    {
        $firstShapeType = DB::table('shape_types')
            ->where('IdShapeGroup', 1)
            ->pluck('id')
            ->toArray();

        $tables = DB::table('tables')
            ->where('IdFloor', $floorId)
            ->whereIn('Shape', $firstShapeType)
            ->get();
---
select `id` from `shape_types` where `IdShapeGroup` = 1
select * from `tables` where `IdFloor` = '78' and `Shape` in (1, 2, 3, 4, 5, 6)