app/Http/Controllers/UserController.php

select * from `restaurants` where `restaurants`.`deleted_at` is null
select * from `promotions`
select * from `restaurants` where `rating` >= 4 and `restaurants`.`deleted_at` is null
select * from `restaurants` where `recomended` > 0 and `restaurants`.`deleted_at` is null order by `recomended` asc
---
    public function index(Request $request)
    {

        $restaurants = Restaurant::all();

        $promotions = Promotion::all();

        $highliyRated = Restaurant::where('rating', '>=', 4)->get();
        $recommendedRestaurants = Restaurant::where('recomended', '>', 0)->orderBy('recomended', 'asc')->get();

select * from `tags` where `tags`.`deleted_at` is null
---
    public function search(Request $request)
    {
        $searchQuery = $request->input('searchRestaurant');
        $searchLocation = $request->input('searchLocation');
        $tags = Tag::all();

select * from `restaurants` where `restaurants`.`deleted_at` is null
---

        // Handle the case where no search query is provided or it's empty
        if (empty($searchQuery) && empty($searchLocation)) {
            $restaurants = Restaurant::all(); // You can change this to your default behavior

select * from `restaurants` where `restaurants`.`deleted_at` is null
---
            return redirect()->route('search', ['searchLocation' => $searchLocation]);
        }

        return view('user.restaurantspage', [
            'allRestaurantsNumber' => $restaurants->count(),
            'restaurants' => $restaurants,
            'searchAddress' => $displayedAddress, // Use the displayed address here
            'searchQuery' => $searchQuery,
            'tags' => $tags
        ]);