app/Http/Controllers/UserReservationController.php

select * from `restaurants` where `restaurants`.`id` = '1' and `restaurants`.`deleted_at` is null limit 1
---
    public function index($restaurantId)
    {
        $restaurant = Restaurant::findOrFail($restaurantId);

select * from `reservations` where `reservations`.`id` is null and `reservations`.`deleted_at` is null limit 1
---
    public function showReservationsForDate($restaurantId, $selectedDate)
    {
        // Extract date components using regular expressions
        preg_match('/(\w{3}) (\w{3}) (\d{2}) (\d{4})/', $selectedDate, $matches);
        $day = $matches[3];
        $month = date('m', strtotime($matches[2]));
        $year = $matches[4];

        $parsedDate = Carbon::create($year, $month, $day)->subDay()->toDateString();

        $restaurant = Restaurant::findOrFail($restaurantId);
        $reservations = $restaurant->reservations()->whereDate('date', $parsedDate)->get();

select * from `working_hours` where `working_hours`.`restaurant_id` = 1 and `working_hours`.`restaurant_id` is not null and date(`work_date`) = '2023-10-20' and `working_hours`.`deleted_at` is null limit 1
select * from `working_hours` where `working_hours`.`restaurant_id` = 1 and `working_hours`.`restaurant_id` is not null and `default_working_time` = 1 and `day_of_week` = 5 and `working_hours`.`deleted_at` is null limit 1
---
    public function getWorkingHours($restaurantId, $selectedDate)
    {
        $restaurant = Restaurant::findOrFail($restaurantId);
        $workingHours = $restaurant->workingHours()->whereDate('work_date', $selectedDate)->first();
        if (!$workingHours) {
            $dayOfWeek = Carbon::parse($selectedDate)->format('l');
            $workingHours = $restaurant->workingHours()->where('default_working_time', 1)->where('day_of_week', $dayOfWeek)->first();

select * from `floors` where `floors`.`id` = '78' limit 1
select `restaurants`.*, `floor_restaurant`.`floor_id` as `pivot_floor_id`, `floor_restaurant`.`restaurant_id` as `pivot_restaurant_id` from `restaurants` inner join `floor_restaurant` on `restaurants`.`id` = `floor_restaurant`.`restaurant_id` where `floor_restaurant`.`floor_id` = 78 and `restaurants`.`deleted_at` is null
---
    public function checkFreeTables(Request $request)
    {
        $floorId = $request->input('floorId');
        $selectedDate = $request->input('date');
        $selectedTime = $request->input('time');

        $floor = Floor::findOrFail($floorId);
        $restaurantId = $floor->restaurant->first()->id;