app/Http/Controllers/UserReservationController.php

    public function delete(Request $request, Reservation $reservation)
    {
        $user = Auth::user();

        if ($reservation) {
            $reservation->delete();
---
update `reservations` set `deleted_at` = '2023-10-03 09:47:14', `reservations`.`updated_at` = '2023-10-03 09:47:14' where `id` = 1